# NLP - NIRF Data
-

In [1]:
import pandas as pd
from selenium import webdriver

In [2]:
from selenium.common.exceptions import NoSuchElementException

In [3]:
import time

In [12]:
from selenium.webdriver.common.by import By

In [6]:
driver_path = 'path/to/chromedriver'
driver = webdriver.Chrome(driver_path)
driver.maximize_window()
time.sleep(3)

C:\Users\Admin\AppData\Local\Temp\ipykernel_20852\2963930768.py:2: DeprecationWarning: executable_path has been deprecated, please pass in a Service object
  driver = webdriver.Chrome(driver_path)

In [4]:
driver = webdriver.Chrome()

In [5]:
driver.maximize_window()
time.sleep(3)

In [6]:
url = 'https://www.nirfindia.org/2023/OverallRanking.html'
driver.get(url)
time.sleep(4)

In [8]:
page=3 #max no of pages for 2023 Overall Ranking

In [9]:
data=[]
score=[]

In [13]:
button= driver.find_element(By.XPATH, value='//a[@class="btn-more-details"]')
button.click()

In [14]:
table1=driver.find_elements(by=By.XPATH, value='//div[@class="tbl_hidden"]//tbody//tr')

In [18]:
#table1
len(table1)  #100 univ data so 100 elements

100

In [19]:
length = len(table1)
for i in range(length):
    #print(i)
    score.append(table1[i].get_attribute('innerHTML'))
    #score.append(" ")

In [22]:
score[0:10]
#this score of 100 orgs

['<td>86.45</td><td>89.88</td><td>87.22</td><td>63.59</td><td>100.00</td>',
 '<td>82.43</td><td>88.45</td><td>80.57</td><td>59.23</td><td>97.94</td>',
 '<td>82.06</td><td>85.23</td><td>79.21</td><td>70.32</td><td>90.98</td>',
 '<td>80.71</td><td>86.14</td><td>84.26</td><td>58.76</td><td>84.98</td>',
 '<td>85.45</td><td>72.94</td><td>83.62</td><td>60.24</td><td>69.84</td>',
 '<td>76.47</td><td>67.75</td><td>70.46</td><td>72.72</td><td>75.23</td>',
 '<td>73.29</td><td>72.25</td><td>76.75</td><td>57.44</td><td>70.68</td>',
 '<td>77.69</td><td>68.00</td><td>83.15</td><td>62.80</td><td>50.36</td>',
 '<td>73.43</td><td>66.98</td><td>82.95</td><td>58.30</td><td>42.44</td>',
 '<td>73.55</td><td>46.56</td><td>94.89</td><td>73.64</td><td>50.73</td>']

In [23]:
df=pd.DataFrame(score)

In [25]:
df.head(3)

                                                   0
0  <td>86.45</td><td>89.88</td><td>87.22</td><td>...
1  <td>82.43</td><td>88.45</td><td>80.57</td><td>...
2  <td>82.06</td><td>85.23</td><td>79.21</td><td>...

In [26]:
df['A']=df[0].apply(lambda x: x.replace('</td>',','))
#remove <td> and </td> from data

In [28]:
df.head()

,0,A
0,<td>86.45</td><td>89.88</td><td>87.22</td><td>...,"<td>86.45,<td>89.88,<td>87.22,<td>63.59,<td>10..."
1,<td>82.43</td><td>88.45</td><td>80.57</td><td>...,"<td>82.43,<td>88.45,<td>80.57,<td>59.23,<td>97..."
2,<td>82.06</td><td>85.23</td><td>79.21</td><td>...,"<td>82.06,<td>85.23,<td>79.21,<td>70.32,<td>90..."
3,<td>80.71</td><td>86.14</td><td>84.26</td><td>...,"<td>80.71,<td>86.14,<td>84.26,<td>58.76,<td>84..."
4,<td>85.45</td><td>72.94</td><td>83.62</td><td>...,"<td>85.45,<td>72.94,<td>83.62,<td>60.24,<td>69..."

In [29]:
df['A']=df[0].apply(lambda x: x.replace('<td>',''))

In [30]:
df['A']=df['A'].apply(lambda x: x.replace('</td>',','))

In [31]:
df.head()

,0,A
0,<td>86.45</td><td>89.88</td><td>87.22</td><td>...,"86.45,89.88,87.22,63.59,100.00,"
1,<td>82.43</td><td>88.45</td><td>80.57</td><td>...,"82.43,88.45,80.57,59.23,97.94,"
2,<td>82.06</td><td>85.23</td><td>79.21</td><td>...,"82.06,85.23,79.21,70.32,90.98,"
3,<td>80.71</td><td>86.14</td><td>84.26</td><td>...,"80.71,86.14,84.26,58.76,84.98,"
4,<td>85.45</td><td>72.94</td><td>83.62</td><td>...,"85.45,72.94,83.62,60.24,69.84,"

In [32]:
df['A']=df['A'].str.split(',')
#split the data delim by ,

In [33]:
df.head()

,0,A
0,<td>86.45</td><td>89.88</td><td>87.22</td><td>...,"[86.45, 89.88, 87.22, 63.59, 100.00, ]"
1,<td>82.43</td><td>88.45</td><td>80.57</td><td>...,"[82.43, 88.45, 80.57, 59.23, 97.94, ]"
2,<td>82.06</td><td>85.23</td><td>79.21</td><td>...,"[82.06, 85.23, 79.21, 70.32, 90.98, ]"
3,<td>80.71</td><td>86.14</td><td>84.26</td><td>...,"[80.71, 86.14, 84.26, 58.76, 84.98, ]"
4,<td>85.45</td><td>72.94</td><td>83.62</td><td>...,"[85.45, 72.94, 83.62, 60.24, 69.84, ]"

In [34]:
df3 = df['A'].apply(pd.Series)
df3.columns = ['A', 'B','C','D','E','F']

In [35]:
df3.head()

       A      B      C      D       E F
0  86.45  89.88  87.22  63.59  100.00
1  82.43  88.45  80.57  59.23   97.94
2  82.06  85.23  79.21  70.32   90.98
3  80.71  86.14  84.26  58.76   84.98
4  85.45  72.94  83.62  60.24   69.84

In [37]:
df3.describe()

            A      B      C      D     E    F
count     100    100    100    100   100  100
unique     99    100     95     97    74    1
top     70.64  89.88  73.26  59.23  8.15
freq        2      1      2      2     4  100

In [42]:
df3.F.unique()  #there is just a space in F col

array([''], dtype=object)

In [43]:
df3.drop('F',axis=1,inplace=True)

In [44]:
df3.head()

       A      B      C      D       E
0  86.45  89.88  87.22  63.59  100.00
1  82.43  88.45  80.57  59.23   97.94
2  82.06  85.23  79.21  70.32   90.98
3  80.71  86.14  84.26  58.76   84.98
4  85.45  72.94  83.62  60.24   69.84

In [45]:
df3.to_clipboard(excel=True)

In [46]:
time.sleep(3)
driver.quit()